# 1 . Inner Join
# 2 . Outer Join
# 3 . Left Join
# 4 . Right Join
# 5 . Suffixes

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({
    "city":["new_york","Chicago","Oriando"],
    "temperature":[23,14,15],
})
df

       city  temperature
0  new_york           23
1   Chicago           14
2   Oriando           15

In [3]:
df1=pd.DataFrame({
    "city":["Chicago","new_york","Oriando"],
    "humidity":[53,4,75],
})
df1

       city  humidity
0   Chicago        53
1  new_york         4
2   Oriando        75

# 1 . INNER JOIN 

## Return records that matching values in both table

In [4]:
data=pd.merge(df,df1,on="city")
data

       city  temperature  humidity
0  new_york           23         4
1   Chicago           14        53
2   Oriando           15        75

In [5]:
df=pd.DataFrame({
    "city":["new_york","Chicago","Oriando","western"],
    "temperature":[23,14,15,32],
})
df

       city  temperature
0  new_york           23
1   Chicago           14
2   Oriando           15
3   western           32

In [6]:
df1=pd.DataFrame({
    "city":["Chicago","new_york","fransico"],
    "humidity":[23,14,15],
})
df1

       city  humidity
0   Chicago        23
1  new_york        14
2  fransico        15

In [7]:
data=pd.merge(df,df1,on="city")
data

       city  temperature  humidity
0  new_york           23        14
1   Chicago           14        23

In [8]:
data=pd.merge(df,df1,on="city",how="inner")
data

       city  temperature  humidity
0  new_york           23        14
1   Chicago           14        23

# OUTER JOIN

## Return the records that matching and Un-matching values from both the tables

In [9]:
df

       city  temperature
0  new_york           23
1   Chicago           14
2   Oriando           15
3   western           32

In [10]:
df1

       city  humidity
0   Chicago        23
1  new_york        14
2  fransico        15

In [11]:
data=pd.merge(df,df1,on="city",how="outer")
data

       city  temperature  humidity
0  new_york         23.0      14.0
1   Chicago         14.0      23.0
2   Oriando         15.0       NaN
3   western         32.0       NaN
4  fransico          NaN      15.0

# LEFT JOIN

## Return all records from the left table and 
## matching records from the right table

In [12]:
df

       city  temperature
0  new_york           23
1   Chicago           14
2   Oriando           15
3   western           32

In [13]:
df1

       city  humidity
0   Chicago        23
1  new_york        14
2  fransico        15

In [14]:
data=pd.merge(df,df1,on="city",how="left")
data

       city  temperature  humidity
0  new_york           23      14.0
1   Chicago           14      23.0
2   Oriando           15       NaN
3   western           32       NaN

# RIGHT JOIN

## Return all records from the right table and 
## matching records from the left table

In [15]:
df

       city  temperature
0  new_york           23
1   Chicago           14
2   Oriando           15
3   western           32

In [16]:
df1

       city  humidity
0   Chicago        23
1  new_york        14
2  fransico        15

In [17]:
data=pd.merge(df,df1,on="city",how="right")
data

       city  temperature  humidity
0   Chicago         14.0        23
1  new_york         23.0        14
2  fransico          NaN        15

# OUTER JOIN

In [18]:
df

       city  temperature
0  new_york           23
1   Chicago           14
2   Oriando           15
3   western           32

In [19]:
df1

       city  humidity
0   Chicago        23
1  new_york        14
2  fransico        15

In [20]:
data=pd.merge(df,df1,on="city",how="outer")
data

       city  temperature  humidity
0  new_york         23.0      14.0
1   Chicago         14.0      23.0
2   Oriando         15.0       NaN
3   western         32.0       NaN
4  fransico          NaN      15.0

In [21]:
data=pd.merge(df,df1,on="city",how="outer",indicator=True)
data

       city  temperature  humidity      _merge
0  new_york         23.0      14.0        both
1   Chicago         14.0      23.0        both
2   Oriando         15.0       NaN   left_only
3   western         32.0       NaN   left_only
4  fransico          NaN      15.0  right_only

# Suffixes

In [22]:
df=pd.DataFrame({
    "city":["new_york","Chicago","Oriando"],
    "temperature":[23,14,15],
    "humidity":[53,4,75],
})
df

       city  temperature  humidity
0  new_york           23        53
1   Chicago           14         4
2   Oriando           15        75

In [23]:
df1=pd.DataFrame({
    "city":["Chicago","new_york","Oriando"],
    "temperature":[23,14,15],
    "humidity":[53,4,75],
})
df1

       city  temperature  humidity
0   Chicago           23        53
1  new_york           14         4
2   Oriando           15        75

In [24]:
data=pd.merge(df,df1,on="city")
data

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new_york             23          53             14           4
1   Chicago             14           4             23          53
2   Oriando             15          75             15          75

In [25]:
data=pd.merge(df,df1,on="city",suffixes=('_left','_right'))
data

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new_york,23,53,14,4
1,Chicago,14,4,23,53
2,Oriando,15,75,15,75